{"0": "Internet Engineering Task Force (IETF)                           D. York", "1": "Request for Comments: 8496                                    Individual", "2": "Category: Informational                                       T. Asveren", "3": "ISSN: 2070-1721                                    Ribbon Communications", "4": "                                                            October 2018", "5": "   P-Charge-Info: A Private Header Field (P-Header) Extension to the", "6": "                   Session Initiation Protocol (SIP)", "7": "Abstract", "8": "   This text documents the current usage of P-Charge-Info, an existing", "9": "   Session Initiation Protocol (SIP) private header field (P-Header)", "10": "   used to convey billing information about the party to be charged.", "11": "   This P-Header is currently used in production by several equipment", "12": "   vendors and carriers and has been in use since at least 2007.  This", "13": "   document details the registration of this header field with IANA.", "14": "Status of This Memo", "15": "   This document is not an Internet Standards Track specification; it is", "16": "   published for informational purposes.", "17": "   This document is a product of the Internet Engineering Task Force", "18": "   (IETF).  It represents the consensus of the IETF community.  It has", "19": "   received public review and has been approved for publication by the", "20": "   Internet Engineering Steering Group (IESG).  Not all documents", "21": "   approved by the IESG are candidates for any level of Internet", "22": "   Standard; see Section 2 of RFC 7841.", "23": "   Information about the current status of this document, any errata,", "24": "   and how to provide feedback on it may be obtained at", "25": "   https://www.rfc-editor.org/info/rfc8496.", "26": "York & Asveren                Informational                     [Page 1]", "27": "\f", "28": "RFC 8496                      P-Charge-Info                 October 2018", "29": "Copyright Notice", "30": "   Copyright (c) 2018 IETF Trust and the persons identified as the", "31": "   document authors.  All rights reserved.", "32": "   This document is subject to BCP 78 and the IETF Trust's Legal", "33": "   Provisions Relating to IETF Documents", "34": "   (https://trustee.ietf.org/license-info) in effect on the date of", "35": "   publication of this document.  Please review these documents", "36": "   carefully, as they describe your rights and restrictions with respect", "37": "   to this document.  Code Components extracted from this document must", "38": "   include Simplified BSD License text as described in Section 4.e of", "39": "   the Trust Legal Provisions and are provided without warranty as", "40": "   described in the Simplified BSD License.", "41": "Table of Contents", "42": "   1.  Overview  . . . . . . . . . . . . . . . . . . . . . . . . . .   3", "43": "   2.  Requirements Language . . . . . . . . . . . . . . . . . . . .   4", "44": "   3.  Purpose of This Document  . . . . . . . . . . . . . . . . . .   4", "45": "   4.  Use Cases . . . . . . . . . . . . . . . . . . . . . . . . . .   4", "46": "   5.  The P-Charge-Info Header  . . . . . . . . . . . . . . . . . .   5", "47": "     5.1.  Applicability Statement for the P-Charge-Info Header", "48": "           Field . . . . . . . . . . . . . . . . . . . . . . . . . .   5", "49": "     5.2.  Usage of the P-Charge-Info Header Field . . . . . . . . .   5", "50": "       5.2.1.  Procedures at the UA  . . . . . . . . . . . . . . . .   5", "51": "       5.2.2.  Procedures at the Proxy . . . . . . . . . . . . . . .   6", "52": "     5.3.  Use-Case Example  . . . . . . . . . . . . . . . . . . . .   6", "53": "   6.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . .   7", "54": "   7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7", "55": "     7.1.  Header Field  . . . . . . . . . . . . . . . . . . . . . .   7", "56": "   8.  Security Considerations . . . . . . . . . . . . . . . . . . .   7", "57": "     8.1.  Trust Relationship  . . . . . . . . . . . . . . . . . . .   7", "58": "     8.2.  Untrusted Peers . . . . . . . . . . . . . . . . . . . . .   8", "59": "       8.2.1.  Ingress from Untrusted Peers  . . . . . . . . . . . .   8", "60": "       8.2.2.  Egress to Untrusted Peers . . . . . . . . . . . . . .   8", "61": "   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   8", "62": "     9.1.  Normative References  . . . . . . . . . . . . . . . . . .   8", "63": "     9.2.  Informative References  . . . . . . . . . . . . . . . . .   9", "64": "   Appendix A.  Alternatives . . . . . . . . . . . . . . . . . . . .  10", "65": "     A.1.  P-Charging-Vector . . . . . . . . . . . . . . . . . . . .  10", "66": "     A.2.  P-DCS-Billing-Info  . . . . . . . . . . . . . . . . . . .  10", "67": "     A.3.  P-Asserted-Identity . . . . . . . . . . . . . . . . . . .  11", "68": "   Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  11", "69": "   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  11", "70": "York & Asveren                Informational                     [Page 2]", "71": "\f", "72": "RFC 8496                      P-Charge-Info                 October 2018", "73": "1.  Overview", "74": "   In certain network configurations, several network entities have", "75": "   found it useful to decouple the identity of the caller (what is", "76": "   normally thought of as \"Caller ID\") from the identity/number used for", "77": "   billing purposes.  This document records the current usage of", "78": "   P-Charge-Info, a private SIP header field, to provide simple billing", "79": "   information and details the registration of this header field with", "80": "   IANA as required by Section 4 of [RFC5727].", "81": "   In a typical configuration, the identity of the caller, commonly", "82": "   referred to as \"Caller ID\" by end users, is derived from one of the", "83": "   following SIP header fields:", "84": "   o  P-Asserted-Identity", "85": "   o  From (in the absence of P-Asserted-Identity)", "86": "   (NOTE: Some service providers have also used the Remote-Party-ID", "87": "   header field, but this was never standardized and was replaced by", "88": "   P-Asserted-Identity in [RFC3325].)", "89": "   This identity/number is typically presented to the receiving user", "90": "   agent (UA), where it is usually displayed for the end user.  It is", "91": "   also typically used for billing purposes by the network entities", "92": "   involved in carrying the session.", "93": "   However, in some network configurations, the \"Caller ID\" presented to", "94": "   the receiving UA may be different from the number to be used for", "95": "   billing purposes.", "96": "   In this case, there exists a need for a way to pass an additional", "97": "   billing identifier that can be used between network entities in order", "98": "   to correctly bill for services.", "99": "   Several carriers, application providers, and equipment providers have", "100": "   been using the P-Charge-Info header field since at least 2007 as a", "101": "   simple mechanism to exchange this billing identifier.", "102": "   This document specifies the use of the P-Charge-Info header field in", "103": "   INVITE requests.  The header field might be useful in other SIP", "104": "   messages, but such use is beyond the scope of this document.", "105": "York & Asveren                Informational                     [Page 3]", "106": "\f", "107": "RFC 8496                      P-Charge-Info                 October 2018", "108": "2.  Requirements Language", "109": "   The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\",", "110": "   \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and", "111": "   \"OPTIONAL\" in this document are to be interpreted as described in", "112": "   BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all", "113": "   capitals, as shown here.", "114": "   The key words describe requirements needed to interoperate with", "115": "   existing usage.", "116": "3.  Purpose of This Document", "117": "   This document has been prepared to document the existing deployed", "118": "   usage of the P-Charge-Info header field and to comply with Section 4", "119": "   of [RFC5727] in registering this header field with IANA.  It is noted", "120": "   that RFC 5727 specifically deprecates new usage of \"P-\" header", "121": "   fields, but P-Charge-Info has been in deployment since before 2007", "122": "   and predates RFC 5727.  Given this, the authors believe that", "123": "   P-Charge-Info is a \"grandfathered case\" per Section 4 of RFC 5727.", "124": "4.  Use Cases", "125": "   The simplest use case for P-Charge-Info is an enterprise environment", "126": "   where each SIP endpoint has a direct number that is passed by the", "127": "   enterprise SIP proxy across to a SIP proxy at a SIP service provider", "128": "   who provides connectivity to the Public Switched Telephone Network", "129": "   (PSTN).  Rather than cause the SIP service provider to have to track", "130": "   each individual direct number for billing purposes, the enterprise", "131": "   SIP proxy sends, in the P-Charge-Info header field, a single billing", "132": "   identifier that the SIP service provider uses for billing purposes.", "133": "   As another example, a hosted telephony provider or hosted voice-", "134": "   application provider may have a large SIP network with customers who", "135": "   are distributed over a very large geographic area and use local-", "136": "   market PSTN numbers, although the network has only a very few actual", "137": "   PSTN interconnection points.", "138": "   The customers may all have local phone numbers, yet outgoing calls", "139": "   are actually routed across a SIP network and out specific PSTN", "140": "   gateways or across specific SIP connections to other SIP service", "141": "   providers.  The hosted provider may want to pass a billing identifier", "142": "   to its SIP service providers either for the purpose of simplicity in", "143": "   billing or to obtain better rates from the SIP service providers.", "144": "York & Asveren                Informational                     [Page 4]", "145": "\f", "146": "RFC 8496                      P-Charge-Info                 October 2018", "147": "5.  The P-Charge-Info Header", "148": "5.1.  Applicability Statement for the P-Charge-Info Header Field", "149": "   The P-Charge-Info header field is applicable within a single private", "150": "   administrative domain or between different administrative domains", "151": "   where there is a trust relationship between the domains.", "152": "5.2.  Usage of the P-Charge-Info Header Field", "153": "   The P-Charge-Info header field is used to convey information about", "154": "   the identity of the party to be charged.  The P-Charge-Info header", "155": "   field is typically inserted into a SIP request, usually an INVITE, by", "156": "   one of the following:", "157": "   o  the SIP proxy on the originating network;", "158": "   o  a PSTN gateway acting as a SIP UA; or", "159": "   o  an application server generating billing information.", "160": "   P-Charge-Info is to be used by the SIP entity that provides billing", "161": "   services for a session.  This could be an entity that is generating", "162": "   billing records or another entity interacting with it.  Upon receipt", "163": "   of an INVITE request with the P-Charge-Info header field, such an", "164": "   entity MAY use the value present in P-Charge-Info as indicating the", "165": "   party responsible for the charges associated with the session.  This", "166": "   decision, for example, could be based on local policy.", "167": "5.2.1.  Procedures at the UA", "168": "   The P-Charge-Info header field may be inserted by PSTN gateways or", "169": "   application servers acting as a SIP UA.", "170": "   The P-Charge-Info header field is ignored by an end-user UA and", "171": "   should not normally be received by such a UA.  It MUST NOT be sent to", "172": "   an end-user UA, as this would provide information to the UA about the", "173": "   party to be charged; providing such information may cause security-", "174": "   related issues; for example, calling-party information would be known", "175": "   by the UA for an otherwise anonymous call.  A UA SHOULD ignore it if", "176": "   it receives this header.  Similarly, an end-user UA originating a SIP", "177": "   message SHOULD NOT insert this header field.", "178": "   A PSTN gateway or application server acting as a UA MAY use the", "179": "   content of the P-Charge-Info header field present in an INVITE", "180": "   request it received as the identity to be charged for the session for", "181": "   billing-related procedures, e.g., in a billing record or during", "182": "   interaction with another entity generating billing records.  A PSTN", "183": "York & Asveren                Informational                     [Page 5]", "184": "\f", "185": "RFC 8496                      P-Charge-Info                 October 2018", "186": "   gateway or application server acting as a UA MAY use the content of", "187": "   the P-Charge-Info header field to populate information about the", "188": "   identity of the party to charge in another type of signaling, such as", "189": "   ISDN User Part (ISUP).", "190": "5.2.2.  Procedures at the Proxy", "191": "   A SIP proxy that supports this extension and receives a request,", "192": "   typically a SIP INVITE, MAY insert a P-Charge-Info header field.  The", "193": "   contents of the inserted header field may be decided based on local", "194": "   policy or by querying an external entity to determine the identity of", "195": "   the party to be charged.", "196": "   When a proxy receives an INVITE request, it MAY use the content of", "197": "   the P-Charge-Info header field contained in the request for billing-", "198": "   related procedures, e.g., in a billing record or during interaction", "199": "   with another entity that is generating billing records.", "200": "   A SIP proxy that does not support this extension will pass any", "201": "   received P-Charge-Info header field unmodified, in compliance with", "202": "   RFC 3261.", "203": "   A proxy supporting this extension MUST remove the P-Charge-Info", "204": "   header field before sending a request to a UA that is not acting as a", "205": "   PSTN gateway or appropriate application server, if the role of the UA", "206": "   is known.", "207": "5.3.  Use-Case Example", "208": "   The content of the P-Charge-Info header field is typically just a", "209": "   SIP/tel URI used as a billing indicator.  An example could be as", "210": "   simple as one of:", "211": "   P-Charge-Info: <sip:+14075550134@example.net;user=phone>", "212": "   P-Charge-Info: <sip:+12345550167@example.com>", "213": "   P-Charge-Info: <sips:1234@example.com>", "214": "   P-Charge-Info: <tel:+14075551234>", "215": "   Any other applicable SIP URI could be used.", "216": "York & Asveren                Informational                     [Page 6]", "217": "\f", "218": "RFC 8496                      P-Charge-Info                 October 2018", "219": "6.  Formal Syntax", "220": "   This RFC contains the definition of one or more SIP header fields", "221": "   that allow choosing between addr-spec and name-addr when constructing", "222": "   header-field values.  [RFC8217] prohibits the use of addr-spec if its", "223": "   value would contain a comma, semicolon, or question mark.", "224": "   The private header field specified here is described in both prose", "225": "   and an augmented Backus-Naur Form (BNF) defined in [RFC5234].", "226": "   Further, several BNF definitions are inherited from SIP and are not", "227": "   repeated here.  Implementors need to be familiar with the notation", "228": "   and contents of [RFC3261] and [RFC5234] to understand this document.", "229": "   The syntax of the P-Charge-Info header field is described as follows:", "230": "         P-Charge-Info = \"P-Charge-Info\" HCOLON (name-addr / addr-spec)", "231": "                 ; name-addr and addr-spec are specified in RFC 3261", "232": "   The SIP URI contained in the name-addr/addr-spec is the billing", "233": "   indicator that is passed between the parties.", "234": "7.  IANA Considerations", "235": "   This specification registers a new proprietary SIP header field", "236": "   according to the procedures defined in [RFC5727].", "237": "7.1.  Header Field", "238": "   The P-Charge-Info private header field has been registered in the", "239": "   \"Header Fields\" subregistry of the \"Session Initiation Protocol (SIP)", "240": "   Parameters\" registry as follows:", "241": "   Header Field Name: P-Charge-Info", "242": "   Compact Form: none", "243": "   Reference: RFC 8496", "244": "8.  Security Considerations", "245": "8.1.  Trust Relationship", "246": "   Given that the information contained in the P-Charge-Info header", "247": "   field will be used for billing purposes, the proxies and other SIP", "248": "   entities that share this information MUST have a trust relationship.", "249": "York & Asveren                Informational                     [Page 7]", "250": "\f", "251": "RFC 8496                      P-Charge-Info                 October 2018", "252": "   If an untrusted entity were inserted between the trusted entities, it", "253": "   could potentially interfere with the billing records for the call.", "254": "   If the SIP connections are not made over a private network, a", "255": "   mechanism for securing the confidentiality and integrity of the SIP", "256": "   connection MUST be used to protect the information.  One such", "257": "   mechanism could be TLS encryption of the SIP signaling stream.", "258": "8.2.  Untrusted Peers", "259": "8.2.1.  Ingress from Untrusted Peers", "260": "   If the P-Charge-Info header field was accepted by a SIP entity from", "261": "   an untrusted peer, there is the potential for fraud if the untrusted", "262": "   entity sent incorrect information, either inadvertently or", "263": "   maliciously.", "264": "   Therefore, a SIP entity MUST remove and ignore the P-Charge-Info", "265": "   header field when it is received from an untrusted entity.", "266": "8.2.2.  Egress to Untrusted Peers", "267": "   If the P-Charge-Info header field was sent by a SIP entity to an", "268": "   untrusted peer, there is potential for exposure of network", "269": "   information that is internal to a trust domain.  For instance, the", "270": "   untrusted entity may learn the identities of public SIP proxies used", "271": "   within the trust domain, which could then potentially be directly", "272": "   attacked.", "273": "   If an implementation does not strip P-Charge-Info from the message", "274": "   where specified in this document, it introduces serious privacy", "275": "   risks.  Examples include revealing third-party billing relationships", "276": "   that might be sensitive, as well as unmasking the identity of callers", "277": "   who wish to remain anonymous.  Depending on circumstances, the latter", "278": "   case may result in unwanted harassment and even physical harm to the", "279": "   calling party.", "280": "   Therefore, a SIP entity MUST remove the P-Charge-Info header field", "281": "   when it is sent to an untrusted entity.", "282": "9.  References", "283": "9.1.  Normative References", "284": "   [RFC2119]  Bradner, S., \"Key words for use in RFCs to Indicate", "285": "              Requirement Levels\", BCP 14, RFC 2119,", "286": "              DOI 10.17487/RFC2119, March 1997,", "287": "              <https://www.rfc-editor.org/info/rfc2119>.", "288": "York & Asveren                Informational                     [Page 8]", "289": "\f", "290": "RFC 8496                      P-Charge-Info                 October 2018", "291": "   [RFC3261]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston,", "292": "              A., Peterson, J., Sparks, R., Handley, M., and E.", "293": "              Schooler, \"SIP: Session Initiation Protocol\", RFC 3261,", "294": "              DOI 10.17487/RFC3261, June 2002,", "295": "              <https://www.rfc-editor.org/info/rfc3261>.", "296": "   [RFC5727]  Peterson, J., Jennings, C., and R. Sparks, \"Change Process", "297": "              for the Session Initiation Protocol (SIP) and the Real-", "298": "              time Applications and Infrastructure Area\", BCP 67,", "299": "              RFC 5727, DOI 10.17487/RFC5727, March 2010,", "300": "              <https://www.rfc-editor.org/info/rfc5727>.", "301": "   [RFC8174]  Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC", "302": "              2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174,", "303": "              May 2017, <https://www.rfc-editor.org/info/rfc8174>.", "304": "   [RFC8217]  Sparks, R., \"Clarifications for When to Use the name-addr", "305": "              Production in SIP Messages\", RFC 8217,", "306": "              DOI 10.17487/RFC8217, August 2017,", "307": "              <https://www.rfc-editor.org/info/rfc8217>.", "308": "9.2.  Informative References", "309": "   [RFC5234]  Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax", "310": "              Specifications: ABNF\", STD 68, RFC 5234,", "311": "              DOI 10.17487/RFC5234, January 2008,", "312": "              <https://www.rfc-editor.org/info/rfc5234>.", "313": "   [RFC3325]  Jennings, C., Peterson, J., and M. Watson, \"Private", "314": "              Extensions to the Session Initiation Protocol (SIP) for", "315": "              Asserted Identity within Trusted Networks\", RFC 3325,", "316": "              DOI 10.17487/RFC3325, November 2002,", "317": "              <https://www.rfc-editor.org/info/rfc3325>.", "318": "   [RFC5503]  Andreasen, F., McKibben, B., and B. Marshall, \"Private", "319": "              Session Initiation Protocol (SIP) Proxy-to-Proxy", "320": "              Extensions for Supporting the PacketCable Distributed Call", "321": "              Signaling Architecture\", RFC 5503, DOI 10.17487/RFC5503,", "322": "              March 2009, <https://www.rfc-editor.org/info/rfc5503>.", "323": "   [RFC7315]  Jesske, R., Drage, K., and C. Holmberg, \"Private Header", "324": "              (P-Header) Extensions to the Session Initiation Protocol", "325": "              (SIP) for the 3GPP\", RFC 7315, DOI 10.17487/RFC7315, July", "326": "              2014, <https://www.rfc-editor.org/info/rfc7315>.", "327": "York & Asveren                Informational                     [Page 9]", "328": "\f", "329": "RFC 8496                      P-Charge-Info                 October 2018", "330": "Appendix A.  Alternatives", "331": "A.1.  P-Charging-Vector", "332": "   P-Charging-Vector is defined in Section 4.6 of [RFC7315] and used by", "333": "   the 3GPP to carry information related to the charging of a session.", "334": "   There are, however, some differences in the semantics associated with", "335": "   P-Charging-Vector and P-Charge-Info.  P-Charging-Vector is mainly", "336": "   used to carry information for correlation of multiple charging", "337": "   records generated for a single session.  On the other hand,", "338": "   P-Charge-Info is used to convey information about the party to be", "339": "   billed for a call.  Furthermore, P-Charging-Vector has a mandatory", "340": "   icid-value parameter that is a globally unique value to identify the", "341": "   session for which the charging information is generated.  Such a", "342": "   globally unique identifier is not necessary when carrying information", "343": "   about the user to be billed when it is attached to the corresponding", "344": "   session-related signaling.", "345": "A.2.  P-DCS-Billing-Info", "346": "   P-DCS-Billing-Info is defined in Section 7 of [RFC5503] and used for", "347": "   passing billing information between trusted entities in the", "348": "   PacketCable Distributed Call Signaling Architecture.  For many", "349": "   billing situations, particularly the very large-scale residential", "350": "   telephone networks for which this header field is designed,", "351": "   P-DCS-Billing-Info is an excellent solution.  However, this ability", "352": "   to address a range of situations adds complexity.  According to RFC", "353": "   5503, the following information is mandatory to include in each use", "354": "   of the P-DCS-Billing-Info header field:", "355": "   o  Billing-Correlation-ID, a globally unique identifier", "356": "   o  Financial-Entity-ID", "357": "   o  RKS-Group-ID (record-keeping server)", "358": "   The P-DCS-Billing-Info header field may also include a variety of", "359": "   additional parameters.", "360": "   While this may work well in many billing scenarios, there are other", "361": "   billing scenarios that do not need this level of complexity.  In", "362": "   those simpler scenarios, all that is needed is a number to use for", "363": "   billing.  P-Charge-Info provides this simple solution for simple", "364": "   billing scenarios.", "365": "   Additionally, according to Section 7.3 of RFC 5503, it is mandatory", "366": "   for a UA to create a Billing-Correlation-ID and insert this into the", "367": "   P-DCS-Billing-Info header field (along with the other required", "368": "York & Asveren                Informational                    [Page 10]", "369": "\f", "370": "RFC 8496                      P-Charge-Info                 October 2018", "371": "   information) sent in the initial SIP INVITE.  This again makes sense", "372": "   for the residential-telephone-service environment for which this", "373": "   header field is designed.  In contrast, P-Charge-Info is designed to", "374": "   be used among proxies and not at all by normal user agents.", "375": "   (P-Charge-Info may, though, be used by user agents associated with", "376": "   PSTN gateways.)", "377": "A.3.  P-Asserted-Identity", "378": "   Early reviewers of this document asked why the P-Asserted-Identity", "379": "   header field documented in [RFC3325] could not be used.  As mentioned", "380": "   in the use-case example above, P-Asserted-Identity is used to", "381": "   indicate the identity of the calling party.  However, in this", "382": "   instance, the requirement is to provide an additional identity of the", "383": "   SIP-to-PSTN interconnect point.", "384": "   It would be typical to find both P-Asserted-Identity and", "385": "   P-Charge-Info used in a SIP exchange.  P-Asserted-Identity would be", "386": "   used to provide the caller identity that would be displayed to the", "387": "   end user as \"Caller ID\", while P-Charge-Info would provide the", "388": "   billing identifier used for the billing associated with the call.", "389": "Acknowledgements", "390": "   The authors thank the following people for their comments: Keith", "391": "   Drage, Miguel Garcia, Sumit Garg, John Haluska, Juha Heinanen,", "392": "   Christer Holmberg, Paul Kyzivat, Adam Roach, Jonathan Rosenberg,", "393": "   Henning Schulzrinne, Tom Taylor, and Glen Wang.", "394": "Authors' Addresses", "395": "   Dan York", "396": "   Individual", "397": "   Keene, NH", "398": "   United States of America", "399": "   Email: dyork@lodestar2.com", "400": "   Tolga Asveren", "401": "   Ribbon Communications", "402": "   3 Paragon Way, Suite 100", "403": "   Freehold, NJ  007728", "404": "   United States of America", "405": "   Email: tasveren@rbbn.com", "406": "York & Asveren                Informational                    [Page 11]", "407": "\f"}